#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./project/terraform/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/movietrackr/movietrackr/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/movietrackr/movietrackr

To view this run in a browser, visit:
https://app.terraform.io/app/anarosh/movietrackr/runs/run-5fRMtstwpAWSUJ88

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.production-vpc: Refreshing state... [id=vpc-0e4217e5e69594839]
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
aws_ecs_cluster.fargate: Refreshing state... [id=arn:aws:ecs:us-east-1:595277504214:cluster/movietrackr-fargate-cluster]
aws_cloudwatch_log_group.api-log-group: Refreshing state... [id=/ecs/api-app]
aws_cloudwatch_log_stream.api-log-stream: Refreshing state... [id=api-app-log-stream]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
aws_internet_gateway.production-igw: Refreshing state... [id=igw-082bc751ba5dfb48e]
aws_subnet.public-subnet-1: Refreshing state... [id=subnet-08fb36170de1f1361]
aws_route_table.public-route-table: Refreshing state... [id=rtb-08703625717f500b2]
aws_subnet.private-subnet-2: Refreshing state... [id=subnet-00cdf45b9bf00c700]
aws_security_group.load-balancer: Refreshing state... [id=sg-0a0914315ed9ff41d]
aws_subnet.public-subnet-2: Refreshing state... [id=subnet-02b511b5a870c9b9d]
aws_subnet.private-subnet-1: Refreshing state... [id=subnet-073a0b795c5dd4039]
aws_route_table.private-route-table: Refreshing state... [id=rtb-0772359e72524bb9d]
aws_alb_target_group.default-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:595277504214:targetgroup/movietrackr-fargate-api-tg/9e5cb1d9274c7922]
aws_eip.elastic-ip-for-nat-gw: Refreshing state... [id=eipalloc-04b3909710f8de18e]
aws_route.public-internet-igw-route: Refreshing state... [id=r-rtb-08703625717f500b21080289494]
aws_route_table_association.public-route-1-association: Refreshing state... [id=rtbassoc-017dd8553bee92298]
aws_route_table_association.private-route-2-association: Refreshing state... [id=rtbassoc-08aa0ba0d455fcafc]
aws_route_table_association.private-route-1-association: Refreshing state... [id=rtbassoc-0421a481fd79d56db]
aws_db_subnet_group.production: Refreshing state... [id=main]
aws_security_group.ecs: Refreshing state... [id=sg-0e61db05549f3caf2]
aws_route_table_association.public-route-2-association: Refreshing state... [id=rtbassoc-031c7f2331bb30d75]
aws_lb.production: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:595277504214:loadbalancer/app/movietrackr-fargate-alb/6869030f4c1277e6]
aws_security_group.rds: Refreshing state... [id=sg-07fc538e240a4304e]
aws_route53_record.flask-aws-record: Refreshing state... [id=Z2XOUYGJL2SNS2_movietrackr_A]
aws_alb_listener.ecs-alb-http-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:595277504214:listener/app/movietrackr-fargate-alb/6869030f4c1277e6/ea482595fc3ea5ff]
aws_nat_gateway.nat-gw: Refreshing state... [id=nat-0de959b9e6bd02370]
aws_route.nat-gw-route: Refreshing state... [id=r-rtb-0772359e72524bb9d1080289494]
aws_db_instance.production: Refreshing state... [id=production]
aws_ecs_task_definition.api-app: Refreshing state... [id=api-app]
aws_ecs_service.api-fargate: Refreshing state... [id=arn:aws:ecs:us-east-1:595277504214:service/movietrackr-fargate-cluster/movietrackr-fargate-api-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.api-app will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "api-app"  {
      ~ id       = "0d53b30a1f8177f8e19c0578a52f179ba29a29587851ebe2afafc72341ae6274" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - command               = [
                      - "gunicorn",
                      - "--bind",
                      - "0.0.0.0:5000",
                      - "app.main:app",
                      - "-k",
                      - "uvicorn.workers.UvicornWorker",
                      - "--log-level=debug",
                    ]
                  - entrypoint            = [
                      - "/home/app/web/entrypoint.prod.sh",
                    ]
                  - environment           = [
                      - {
                          - name  = "DATABASE_TEST_URL"
                          - value = "postgres://postgres:postgres@api-db:5432/api_test"
                        },
                      - {
                          - name  = "DATABASE_URL"
                          - value = "postgres://webapp:foobarbaz@production.ctffmwo1n6aa.us-east-1.rds.amazonaws.com:5432/api_prod"
                        },
                      - {
                          - name  = "TMDB_API_KEY"
                          - value = "53be01b6fa2b51ae21e087618a66c87f"
                        },
                    ]
                  - essential             = true
                  - image                 = "ghcr.io/nessadc/api:prod"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/api-app"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "api-app-log-stream"
                        }
                    }
                  - name                  = "api-app"
                  - portMappings          = [
                      - {
                          - containerPort = 5000
                          - hostPort      = 5000
                          - protocol      = "tcp"
                        },
                    ]
                  - repositoryCredentials = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:595277504214:secret:github_packages-r7cp9Y"
                    }
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_db_instance.production will be updated in-place
  ~ resource "aws_db_instance" "production" {
      ~ engine_version                        = "12.5" -> "12.3"
        id                                    = "production"
        name                                  = "api_prod"
        tags                                  = {}
        # (42 unchanged attributes hidden)
    }

  # aws_ecs_service.api-fargate will be updated in-place
  ~ resource "aws_ecs_service" "api-fargate" {
        id                                 = "arn:aws:ecs:us-east-1:595277504214:service/movietrackr-fargate-cluster/movietrackr-fargate-api-service"
        name                               = "movietrackr-fargate-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:595277504214:task-definition/api-app:14" -> (known after apply)
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.api-app must be replaced
-/+ resource "aws_ecs_task_definition" "api-app" {
      ~ arn                      = "arn:aws:ecs:us-east-1:595277504214:task-definition/api-app:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command               = [
                      - "gunicorn",
                      - "--bind",
                      - "0.0.0.0:5000",
                      - "app.main:app",
                      - "-k",
                      - "uvicorn.workers.UvicornWorker",
                      - "--log-level=debug",
                    ]
                  - cpu                   = 0
                  - entryPoint            = [
                      - "/home/app/web/entrypoint.prod.sh",
                    ]
                  - environment           = [
                      - {
                          - name  = "DATABASE_TEST_URL"
                          - value = "postgres://postgres:postgres@api-db:5432/api_test"
                        },
                      - {
                          - name  = "DATABASE_URL"
                          - value = "postgres://webapp:foobarbaz@production.ctffmwo1n6aa.us-east-1.rds.amazonaws.com:5432/api_prod"
                        },
                      - {
                          - name  = "TMDB_API_KEY"
                          - value = "53be01b6fa2b51ae21e087618a66c87f"
                        },
                    ]
                  - essential             = true
                  - image                 = "ghcr.io/nessadc/api:prod"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/api-app"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "api-app-log-stream"
                        }
                    }
                  - mountPoints           = []
                  - name                  = "api-app"
                  - portMappings          = [
                      - {
                          - containerPort = 5000
                          - hostPort      = 5000
                          - protocol      = "tcp"
                        },
                    ]
                  - repositoryCredentials = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:595277504214:secret:github_packages-r7cp9Y"
                    }
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "api-app" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```
</details>
*Pusher: @nessadc, Action: `pull_request`*